isc-fs/stm32-can-bootloader/Core/Src/main.c
	/* 2) Entry point inside app in FLASH */
	if (appEntry < BL_APP_BASE || appEntry > BL_APP_END) {
		LED_ERR_ON();
		return;
	}

	/* --- Disable peripherals and jump --- */

	/* #125 H6: kick the watchdog once more right before handing off, so
	 * the app inherits a full ~8 s window to reach its own IWDG re-init
	 * (the AMS app gets there in ~50-70 ms; IFS08-CE-AMS#280). Must happen
	 * BEFORE the __set_MSP below — once the stack pointer is swapped to the
	 * app's stack we can no longer make ordinary function calls. */
	bl_iwdg_refresh();

	for (uint8_t b = 0U; b < BL_FDCAN_BUS_COUNT; b++) {
		HAL_FDCAN_DeInit(bl_fdcan_bus(b));
	}
	HAL_DeInit();

	/* Stop SysTick */
	SysTick->CTRL = 0;
	SysTick->LOAD = 0;
	SysTick->VAL = 0;

	__disable_irq();

	/* App vector table */
	SCB->VTOR = BL_APP_BASE;   // 0x08020000

	/* Make the VTOR write globally visible before anything that might
	 * read or be affected by it. On Cortex-M7 (vs M4 or M0) the CPU has
	 * a separate L1 I-cache and a speculative instruction prefetcher,
	 * plus a deeper pipeline; without an explicit data-synchronisation
	 * barrier here an instruction fetch that started before the VTOR
	 * change can still complete against the OLD vector table.
	 *
	 * The BL doesn't enable I/D-cache today, so the cache-coherency
	 * piece is latent — but ARM AN-298 (and the STM32H7 HAL examples)
	 * specify the DSB/ISB pair regardless of cache state, and we want
	 * this to be a no-op the day someone flips cache on to speed up
	 * CRC / VERIFY. Issue #67. */
	__DSB();

	/* Application stack */
	__set_MSP(appStack);

	/* Pipeline barrier so the MSP change is in effect before the next
	 * instruction starts executing. Without this the CPU is allowed
	 * to speculatively decode the upcoming `JumpToApp()` indirect
	 * branch with the OLD MSP in its rename state, which on a deep
	 * M7 pipeline could affect exception-frame placement if a fault
	 * triggered during the transition window. Issue #67. */
	__ISB();

	/* IRQs stay masked across the jump. The previous code re-enabled
	 * them here, which let any IRQ that was pending while masked (e.g.
	 * a queued SysTick — CTRL=0 above stops the counter but doesn't
	 * clear the pending flag) dispatch through the new VTOR before the
	 * application's Reset_Handler has run: the app's peripherals
	 * aren't initialised, its globals aren't relocated, stack-beyond-
	 * MSP isn't set up. Result: undefined behaviour at jump time,
	 * intermittent fault under bus load.
	 *
	 * The app's HAL_Init() / Reset_Handler will re-enable IRQs after
	 * it owns the CPU state. Matches the convention used by other
	 * production bootloaders (e.g. AM32-bootloader's blutil jump:
	 * disable once, never re-enable on the BL side). Issue #59. */

	/* Jump to app */
	JumpToApp();

	/* Just in case */
	while (1) {
	}
}
static uint32_t Bootloader_CalcCrc32(uint32_t address, uint32_t lengthBytes) {
	uint32_t crc = 0xFFFFFFFFU;
	uint8_t *ptr = (uint8_t*) address;

	for (uint32_t i = 0; i < lengthBytes; i++) {
		crc ^= ptr[i];
		for (uint32_t bit = 0; bit < 8; bit++) {
			if (crc & 1U) {
				crc = (crc >> 1) ^ 0xEDB88320U;  // polinomial CRC32-IEEE
			} else {
				crc >>= 1;
			}
		}
	}

	crc ^= 0xFFFFFFFFU;
	return crc;
}

static uint8_t Bootloader_CheckApplicationCompute(void) {
	/* Read metadata from flash */
	uint32_t const *meta = (uint32_t const*) BL_APP_METADATA_ADDR;

	uint32_t magic = meta[0];
	uint32_t size = meta[1];
	uint32_t crc = meta[2];
	uint32_t appBase = meta[3];

	if (magic != BL_APP_META_MAGIC) {
		return 0x10;  // incorrect magic -> no valid firmware
	}

	if ((size == 0U) || (size > BL_APP_SIZE)) {
		return 0x11;  // invalid size
	}

	if ((crc == 0U) || (crc == 0xFFFFFFFFU)) {
		return 0x12;  // Invalid CRC
	}

	if (appBase != BL_APP_BASE) {
		return 0x13;  // metadata does not correspond to this configuration
	}
	/* Recalculate CRC on the Flash app to be sure */
	uint32_t crcCalc = Bootloader_CalcCrc32(BL_APP_BASE, size);
	if (crcCalc != crc) {
		return 0x14;  // Calculated CRC does not match stored CRC
	}

	/* Check vector table (stack pointer and entry) */
	uint32_t appStack = *(__IO uint32_t*) BL_APP_BASE;
	uint32_t appEntry = *(__IO uint32_t*) (BL_APP_BASE + 4U);

	/* Stack in DTCM or D1 RAM. Previously this used bitmask checks
	 * (& 0x2FF00000 == 0x24000000) that accepted the full 1 MB above
	 * 0x24000000 — much larger than the real 320 KB RAM_D1 — while
	 * Bootloader_JumpToApplication used a stricter range check. That
	 * divergence let a malformed app pass Check and then silently
	 * fail at Jump time with only an LED_ERR_ON. Both now share the
	 * same predicate (see bl_app_validate.h). Issue #66. */
	if (!bl_app_stack_in_legal_range(appStack)) {
		return 0x15;
	}

	/* entry must be within the app's range */
	if ((appEntry < BL_APP_BASE)
			|| (appEntry >= (BL_APP_BASE + BL_APP_SIZE))) {
		return 0x16;  // entry out of range
	}

	return 0x00;  //OK
}

/* #146 H2: cached public entry point. The full CRC32 over the app
 * (Bootloader_CheckApplicationCompute) is too expensive to run every
 * main-loop tick; cache the verdict and recompute only when flash may have
 * changed (Bootloader_InvalidateAppCheckCache, called from the FLASH_*
 * handlers). The boot decision + jump path read the same cached value. */
uint8_t Bootloader_CheckApplication(void) {
	if (g_appcheck_valid == 0U) {
		g_appcheck_result = Bootloader_CheckApplicationCompute();
		g_appcheck_valid  = 1U;
	}
	return g_appcheck_result;
}

/* #146 H2: drop the cached verdict — call after any FLASH_* op so the next
 * Bootloader_CheckApplication re-reads flash. */
void Bootloader_InvalidateAppCheckCache(void) {
	g_appcheck_valid = 0U;
}

static uint8_t Bootloader_IsBootRequestActive(void) {
	/* Enable backup domain access.
	 PWR clock is already enabled by SystemClock_Config(), so we do not call
	 __HAL_RCC_PWR_CLK_ENABLE() here. */
	HAL_PWR_EnableBkUpAccess();

